import { QuestionAndAnswerProp } from './Game2.types'

export const game2QuestionAndAnswer: QuestionAndAnswerProp[] = [
  {
    question: '당신이 우주선의 조종사라면, <br />어떤 스타일로 조종하시겠습니까?',
    answers: [
      {
        type: 'E',
        answer: '크루와 함께 의사결정을 내리며 원활한 커뮤니케이션 유지한다.',
      },
      {
        type: 'I',
        answer: '혼자서 조용히 생각하며 최선의 결정 내린다.',
      },
    ],
  },
  {
    question: '우주 여행을 계획한다면 어떤 방식을 선택할까요?',
    answers: [
      {
        type: 'S',
        answer: '세부적인 계획을 세우고 모든 가능성을 고려한다.',
      },
      {
        type: 'N',
        answer: '큰 그림을 그리며 미래의 가능성에 초점을 맞춘다.',
      },
    ],
  },
  {
    question: '우주선이 고장 난 경우 어떻게 대처할까요?',
    answers: [
      {
        type: 'T',
        answer: '문제를 분석하고 가장 효율적인 해결책을 찾는다.',
      },
      {
        type: 'F',
        answer: '크루들의 안전과 기분을 최우선으로 생각한다.',
      },
    ],
  },
  {
    question: '새로운 행성에 도착한 후 당신의 첫 번째 행동은 무엇일까요?',
    answers: [
      {
        type: 'J',
        answer: '미리 계획된 탐사 일정에 따라 행동한다.',
      },
      {
        type: 'P',
        answer: '순간적으로 결정하여 융통성 있게 탐사한다.',
      },
    ],
  },
  {
    question: '당신이 우주선의 조종사라면, <br/>어떤 스타일로 조종하시겠습니까?',
    answers: [
      {
        type: 'E',
        answer: '크루와 함께 의사결정을 내리며 <br/>원활한 커뮤니케이션에 신경쓴다.',
      },
      {
        type: 'I',
        answer: '혼자서 조용히 생각하며 최선의 결정 내린다.',
      },
    ],
  },
  {
    question: '만약에 태양이 내일 사라진다면, <br/>오늘 무엇을 할건가요?',
    answers: [
      {
        type: 'S',
        answer: '나사에 연락해서 배편을 구한다.',
      },
      {
        type: 'N',
        answer: '마지막 태양을 사진으로 기록한다.',
      },
    ],
  },
  {
    question: '우주탐사 중, 혼자 고립되어버린다면 <br/>어떻게 하시겠습니까?',
    answers: [
      {
        type: 'T',
        answer: '혹시 모르는 구조를 위해, <br />다른 부대원에게 자신의 상태를 음성으로 기록한다.',
      },
      {
        type: 'F',
        answer: '지구에 있을 가족들에게 음성 메시지를 남긴다.',
      },
    ],
  },
  {
    question: '내일, 우주 비행 당일이다. <br />전날 무엇을 할 건가요?',
    answers: [
      {
        type: 'J',
        answer: '메뉴얼을 확인하고, <br />위험이 발생할 수 있는 상황에 대해 미리 대처 방법을 계획한다.',
      },
      {
        type: 'P',
        answer: '설레는 우주 여행! <br />일찍 자고 일어날 계획을 세우나, 너무 설레서 잠을 설친다.',
      },
    ],
  },
  {
    question: '만약 우주에서 외계 생명체를 만난다면 <br />어떻게 대응할 것인가요?',
    answers: [
      {
        type: 'E',
        answer: '친화적으로 접근하여 소통하려고 시도한다.',
      },
      {
        type: 'I',
        answer: '주변 환경과 상황을 분석하여 조심스럽게 접근한다.',
      },
    ],
  },
  {
    question: '당신이 새로운 행성을 발견한다면, <br />어떤 정보를 가장 먼저 알고 싶으신가요?',
    answers: [
      {
        type: 'S',
        answer: '위치, 물이 존재하는지, <br />위성의 존재와 같은 구체적인 사실들을 기록한다.',
      },
      {
        type: 'N',
        answer: '고리의 유무나 행성의 색상 등 외형부터 관찰한다.',
      },
    ],
  },
  {
    question: '외계 생명체가 처음으로 지구에 방문한다면,',
    answers: [
      {
        type: 'T',
        answer: '그들의 기술력과 지식 수준 등 <br />구체적인 정보 파악을 먼저 파악한다.',
      },
      {
        type: 'F',
        answer: '그들의 감정과 의도를 이해하기 위해 최선을 다한다.',
      },
    ],
  },
  {
    question: '우주비행사 선발 시험이 한 달 뒤에 있습니다. <br />내일 당장 무엇을 하시겠습니까?',
    answers: [
      {
        type: 'P',
        answer: '오늘은 일단 푹 자고, <br />내일 일어나는 시간 봐서 적절히 공부하겠다.',
      },
      {
        type: 'J',
        answer: '한달 남았으니까, 출제 유형을 찾아보기 시작한다. <br />내일은 찾은 내용을 노션에 정리한다.',
      },
    ],
  },
]
